sysbench/qzip/oltp_read_write.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 83.56 qps: 1701.50 (r/w/o: 1192.24/95.06/414.20) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 75.70 qps: 1514.17 (r/w/o: 1059.85/83.20/371.12) lat (ms,95%): 383.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 74.40 qps: 1488.04 (r/w/o: 1041.63/83.30/363.11) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 84.10 qps: 1682.09 (r/w/o: 1177.46/95.21/409.42) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 85.60 qps: 1711.91 (r/w/o: 1198.34/95.89/417.68) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 82.10 qps: 1642.04 (r/w/o: 1149.43/91.30/401.31) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 84.19 qps: 1683.88 (r/w/o: 1178.71/95.09/410.07) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 83.50 qps: 1670.04 (r/w/o: 1169.03/93.30/407.71) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 81.00 qps: 1619.95 (r/w/o: 1133.97/88.50/397.49) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 80.72 qps: 1614.35 (r/w/o: 1130.04/91.12/393.18) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 80.89 qps: 1617.72 (r/w/o: 1132.41/90.98/394.33) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 82.80 qps: 1655.97 (r/w/o: 1159.18/91.90/404.89) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 79.60 qps: 1591.88 (r/w/o: 1114.39/89.50/388.00) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 80.20 qps: 1604.12 (r/w/o: 1122.81/90.20/391.10) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 80.60 qps: 1612.00 (r/w/o: 1128.40/91.30/392.30) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 88.60 qps: 1772.00 (r/w/o: 1240.40/100.10/431.50) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 85.50 qps: 1709.98 (r/w/o: 1196.98/96.70/416.29) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 82.60 qps: 1652.00 (r/w/o: 1156.40/93.70/401.90) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 84.90 qps: 1698.03 (r/w/o: 1188.62/94.40/415.01) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 73.91 qps: 1478.20 (r/w/o: 1034.74/84.31/359.15) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 83.09 qps: 1661.75 (r/w/o: 1163.22/93.29/405.24) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 81.11 qps: 1622.10 (r/w/o: 1135.47/91.51/395.13) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 85.60 qps: 1711.91 (r/w/o: 1198.33/96.59/416.98) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 87.30 qps: 1746.00 (r/w/o: 1222.20/97.20/426.60) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 115.40 qps: 2307.97 (r/w/o: 1615.58/129.90/562.49) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 115.20 qps: 2304.03 (r/w/o: 1612.82/128.70/562.51) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 118.40 qps: 2368.00 (r/w/o: 1657.60/135.90/574.50) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 118.39 qps: 2367.86 (r/w/o: 1657.50/133.39/576.97) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 116.70 qps: 2334.05 (r/w/o: 1633.83/131.90/568.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 115.30 qps: 2306.02 (r/w/o: 1614.21/129.40/562.40) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 16 tps: 116.60 qps: 2332.07 (r/w/o: 1632.45/130.70/568.92) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 16 tps: 118.40 qps: 2368.00 (r/w/o: 1657.60/134.40/576.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 16 tps: 112.10 qps: 2241.96 (r/w/o: 1569.38/126.90/545.69) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 16 tps: 113.60 qps: 2272.03 (r/w/o: 1590.42/128.30/553.31) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 16 tps: 115.20 qps: 2304.08 (r/w/o: 1612.86/129.10/562.12) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 16 tps: 113.59 qps: 2271.88 (r/w/o: 1590.32/128.99/552.57) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 16 tps: 115.01 qps: 2300.26 (r/w/o: 1610.18/131.41/558.66) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 16 tps: 112.19 qps: 2243.85 (r/w/o: 1570.70/125.59/547.56) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 16 tps: 118.40 qps: 2367.93 (r/w/o: 1657.55/134.80/575.58) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 16 tps: 115.20 qps: 2303.96 (r/w/o: 1612.77/131.70/559.49) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 16 tps: 112.10 qps: 2242.02 (r/w/o: 1569.41/127.20/545.40) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 16 tps: 115.20 qps: 2304.02 (r/w/o: 1612.82/130.10/561.11) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 16 tps: 113.59 qps: 2271.88 (r/w/o: 1590.32/130.89/550.67) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 16 tps: 113.61 qps: 2272.12 (r/w/o: 1590.48/128.61/553.03) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 16 tps: 112.12 qps: 2242.40 (r/w/o: 1569.68/125.52/547.20) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 16 tps: 118.39 qps: 2367.82 (r/w/o: 1657.47/133.79/576.56) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 16 tps: 115.19 qps: 2303.83 (r/w/o: 1612.68/129.79/561.36) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 16 tps: 115.21 qps: 2304.13 (r/w/o: 1612.89/132.81/558.43) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 16 tps: 118.48 qps: 2369.65 (r/w/o: 1658.76/135.38/575.52) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 16 tps: 115.21 qps: 2304.14 (r/w/o: 1612.90/131.01/560.23) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 16 tps: 115.20 qps: 2304.00 (r/w/o: 1612.80/131.30/559.90) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 16 tps: 112.20 qps: 2244.00 (r/w/o: 1570.80/127.00/546.20) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 16 tps: 116.82 qps: 2336.38 (r/w/o: 1635.46/134.82/566.09) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 16 tps: 112.08 qps: 2241.64 (r/w/o: 1569.15/128.48/544.01) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 16 tps: 113.60 qps: 2272.00 (r/w/o: 1590.40/130.90/550.70) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 16 tps: 113.70 qps: 2274.00 (r/w/o: 1591.80/131.00/551.20) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 16 tps: 112.30 qps: 2245.98 (r/w/o: 1572.19/128.20/545.60) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 16 tps: 113.50 qps: 2270.02 (r/w/o: 1589.01/129.30/551.70) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 16 tps: 118.30 qps: 2366.00 (r/w/o: 1656.20/137.10/572.70) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 16 tps: 115.20 qps: 2304.00 (r/w/o: 1612.80/132.70/558.50) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 610s ] thds: 16 tps: 115.50 qps: 2309.97 (r/w/o: 1616.98/129.60/563.39) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 620s ] thds: 16 tps: 123.00 qps: 2460.03 (r/w/o: 1722.02/140.50/597.51) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 630s ] thds: 16 tps: 120.00 qps: 2392.09 (r/w/o: 1677.80/135.20/579.10) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 640s ] thds: 16 tps: 113.80 qps: 2283.90 (r/w/o: 1595.40/133.30/555.20) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 650s ] thds: 16 tps: 121.40 qps: 2427.97 (r/w/o: 1699.58/139.30/589.09) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 660s ] thds: 16 tps: 118.50 qps: 2370.03 (r/w/o: 1659.02/138.80/572.21) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 670s ] thds: 16 tps: 118.40 qps: 2368.00 (r/w/o: 1657.60/136.40/574.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 680s ] thds: 16 tps: 118.40 qps: 2368.00 (r/w/o: 1657.60/134.70/575.70) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 690s ] thds: 16 tps: 121.60 qps: 2431.94 (r/w/o: 1702.36/141.50/588.09) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 700s ] thds: 16 tps: 123.20 qps: 2464.00 (r/w/o: 1724.80/142.20/597.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 710s ] thds: 16 tps: 118.50 qps: 2370.03 (r/w/o: 1659.02/138.30/572.71) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 720s ] thds: 16 tps: 118.30 qps: 2348.04 (r/w/o: 1644.26/134.10/569.69) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 730s ] thds: 16 tps: 119.90 qps: 2415.99 (r/w/o: 1690.56/138.71/586.72) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 740s ] thds: 16 tps: 115.30 qps: 2305.97 (r/w/o: 1614.18/131.00/560.79) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 750s ] thds: 16 tps: 120.00 qps: 2400.03 (r/w/o: 1680.02/139.40/580.61) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 760s ] thds: 16 tps: 123.30 qps: 2465.95 (r/w/o: 1726.16/143.10/596.69) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 770s ] thds: 16 tps: 126.40 qps: 2528.05 (r/w/o: 1769.64/146.00/612.41) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 780s ] thds: 16 tps: 124.70 qps: 2493.92 (r/w/o: 1745.75/143.60/604.58) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 790s ] thds: 16 tps: 109.20 qps: 2184.07 (r/w/o: 1528.85/125.30/529.92) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 800s ] thds: 16 tps: 115.10 qps: 2301.99 (r/w/o: 1611.39/134.40/556.20) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 810s ] thds: 16 tps: 123.20 qps: 2464.08 (r/w/o: 1724.86/140.80/598.42) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 820s ] thds: 16 tps: 119.89 qps: 2397.89 (r/w/o: 1678.53/138.29/581.07) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 830s ] thds: 16 tps: 116.80 qps: 2336.03 (r/w/o: 1635.22/134.50/566.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 840s ] thds: 16 tps: 118.20 qps: 2364.00 (r/w/o: 1654.80/140.60/568.60) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 850s ] thds: 16 tps: 116.90 qps: 2338.00 (r/w/o: 1636.60/134.60/566.80) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 860s ] thds: 16 tps: 115.30 qps: 2305.97 (r/w/o: 1614.18/136.30/555.49) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 870s ] thds: 16 tps: 118.20 qps: 2364.09 (r/w/o: 1654.87/136.61/572.62) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 880s ] thds: 16 tps: 115.20 qps: 2303.94 (r/w/o: 1612.76/133.40/557.79) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 890s ] thds: 16 tps: 115.10 qps: 2302.00 (r/w/o: 1611.40/132.60/558.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 900s ] thds: 16 tps: 120.00 qps: 2399.92 (r/w/o: 1679.94/140.60/579.38) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 910s ] thds: 16 tps: 117.00 qps: 2340.00 (r/w/o: 1638.00/136.30/565.70) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 920s ] thds: 16 tps: 115.30 qps: 2306.03 (r/w/o: 1614.22/137.70/554.11) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 930s ] thds: 16 tps: 117.12 qps: 2342.31 (r/w/o: 1639.62/134.72/567.97) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 940s ] thds: 16 tps: 121.70 qps: 2433.92 (r/w/o: 1703.74/142.60/587.58) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 950s ] thds: 16 tps: 113.69 qps: 2273.83 (r/w/o: 1591.68/130.49/551.66) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 960s ] thds: 16 tps: 116.91 qps: 2338.14 (r/w/o: 1636.70/139.01/562.43) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 970s ] thds: 16 tps: 116.79 qps: 2335.86 (r/w/o: 1635.10/138.29/562.47) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 980s ] thds: 16 tps: 115.20 qps: 2303.97 (r/w/o: 1612.78/134.20/556.99) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 990s ] thds: 16 tps: 120.00 qps: 2400.03 (r/w/o: 1680.02/140.90/579.11) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1000s ] thds: 16 tps: 118.50 qps: 2370.01 (r/w/o: 1659.00/141.50/569.50) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1010s ] thds: 16 tps: 119.91 qps: 2398.15 (r/w/o: 1678.70/139.71/579.74) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1020s ] thds: 16 tps: 116.89 qps: 2337.81 (r/w/o: 1636.47/136.39/564.96) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1030s ] thds: 16 tps: 118.30 qps: 2366.03 (r/w/o: 1656.22/140.50/569.31) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 1040s ] thds: 16 tps: 118.50 qps: 2370.00 (r/w/o: 1659.00/138.70/572.30) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1050s ] thds: 16 tps: 115.20 qps: 2304.00 (r/w/o: 1612.80/136.00/555.20) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1060s ] thds: 16 tps: 119.80 qps: 2395.97 (r/w/o: 1677.18/141.30/577.49) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1070s ] thds: 16 tps: 121.70 qps: 2434.03 (r/w/o: 1703.82/145.80/584.41) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1080s ] thds: 16 tps: 118.40 qps: 2368.00 (r/w/o: 1657.60/141.10/569.30) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1090s ] thds: 16 tps: 120.10 qps: 2401.93 (r/w/o: 1681.35/141.70/578.88) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1100s ] thds: 16 tps: 119.50 qps: 2390.00 (r/w/o: 1673.00/138.40/578.60) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1110s ] thds: 16 tps: 119.90 qps: 2397.96 (r/w/o: 1678.57/142.50/576.89) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1120s ] thds: 16 tps: 118.50 qps: 2370.05 (r/w/o: 1659.03/138.10/572.91) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1130s ] thds: 16 tps: 116.90 qps: 2337.96 (r/w/o: 1636.57/138.90/562.49) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1140s ] thds: 16 tps: 115.20 qps: 2304.02 (r/w/o: 1612.81/137.10/554.10) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1150s ] thds: 16 tps: 118.40 qps: 2368.03 (r/w/o: 1657.62/140.30/570.11) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1160s ] thds: 16 tps: 113.70 qps: 2273.98 (r/w/o: 1591.79/135.70/546.50) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1170s ] thds: 16 tps: 113.80 qps: 2276.08 (r/w/o: 1593.26/135.00/547.82) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1180s ] thds: 16 tps: 119.90 qps: 2398.03 (r/w/o: 1678.62/142.90/576.51) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1190s ] thds: 16 tps: 116.80 qps: 2335.97 (r/w/o: 1635.18/140.30/560.49) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1200s ] thds: 16 tps: 120.10 qps: 2402.06 (r/w/o: 1681.44/143.80/576.81) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1210s ] thds: 16 tps: 119.90 qps: 2397.94 (r/w/o: 1678.56/143.00/576.39) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1220s ] thds: 16 tps: 121.60 qps: 2431.97 (r/w/o: 1702.38/144.20/585.39) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1230s ] thds: 16 tps: 113.90 qps: 2278.00 (r/w/o: 1594.60/134.90/548.50) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1240s ] thds: 16 tps: 119.90 qps: 2398.02 (r/w/o: 1678.61/144.60/574.81) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1250s ] thds: 16 tps: 113.52 qps: 2270.43 (r/w/o: 1589.30/135.73/545.40) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1260s ] thds: 16 tps: 119.98 qps: 2399.52 (r/w/o: 1679.66/142.07/577.78) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1270s ] thds: 16 tps: 116.90 qps: 2337.99 (r/w/o: 1636.59/135.90/565.50) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1280s ] thds: 16 tps: 113.60 qps: 2272.05 (r/w/o: 1590.43/135.50/546.11) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1290s ] thds: 16 tps: 115.20 qps: 2304.00 (r/w/o: 1612.80/136.00/555.20) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1300s ] thds: 16 tps: 116.90 qps: 2337.97 (r/w/o: 1636.58/139.90/561.49) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1310s ] thds: 16 tps: 112.20 qps: 2244.03 (r/w/o: 1570.82/132.90/540.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1320s ] thds: 16 tps: 115.11 qps: 2290.38 (r/w/o: 1605.63/134.01/550.74) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1330s ] thds: 16 tps: 112.19 qps: 2255.56 (r/w/o: 1576.53/133.19/545.84) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1340s ] thds: 16 tps: 112.10 qps: 2241.99 (r/w/o: 1569.40/131.30/541.30) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1350s ] thds: 16 tps: 113.60 qps: 2272.00 (r/w/o: 1590.40/135.40/546.20) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1360s ] thds: 16 tps: 112.00 qps: 2240.06 (r/w/o: 1568.04/131.70/540.31) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1370s ] thds: 16 tps: 115.10 qps: 2302.01 (r/w/o: 1611.40/138.10/552.50) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1380s ] thds: 16 tps: 115.30 qps: 2305.98 (r/w/o: 1614.18/138.50/553.29) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1390s ] thds: 16 tps: 117.01 qps: 2340.22 (r/w/o: 1638.15/138.01/564.05) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1400s ] thds: 16 tps: 118.39 qps: 2367.76 (r/w/o: 1657.43/141.79/568.54) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1410s ] thds: 16 tps: 118.42 qps: 2368.42 (r/w/o: 1657.90/141.93/568.60) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1420s ] thds: 16 tps: 113.58 qps: 2271.61 (r/w/o: 1590.13/133.98/547.51) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1430s ] thds: 16 tps: 118.40 qps: 2368.03 (r/w/o: 1657.62/141.20/569.21) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1440s ] thds: 16 tps: 115.10 qps: 2302.08 (r/w/o: 1611.45/135.80/554.82) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1450s ] thds: 16 tps: 115.30 qps: 2306.08 (r/w/o: 1614.26/140.00/551.82) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1460s ] thds: 16 tps: 115.19 qps: 2303.83 (r/w/o: 1612.68/139.59/551.56) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1470s ] thds: 16 tps: 118.40 qps: 2368.01 (r/w/o: 1657.60/144.40/566.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1480s ] thds: 16 tps: 116.80 qps: 2336.01 (r/w/o: 1635.20/140.10/560.70) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1490s ] thds: 16 tps: 118.30 qps: 2365.94 (r/w/o: 1656.16/139.40/570.38) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1500s ] thds: 16 tps: 120.10 qps: 2401.99 (r/w/o: 1681.39/144.20/576.40) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1510s ] thds: 16 tps: 119.80 qps: 2396.08 (r/w/o: 1677.26/146.21/572.62) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1520s ] thds: 16 tps: 116.90 qps: 2338.00 (r/w/o: 1636.60/141.50/559.90) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1530s ] thds: 16 tps: 121.50 qps: 2430.00 (r/w/o: 1701.00/145.70/583.30) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1540s ] thds: 16 tps: 120.00 qps: 2399.93 (r/w/o: 1679.95/143.50/576.48) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1550s ] thds: 16 tps: 120.00 qps: 2400.08 (r/w/o: 1680.05/144.90/575.12) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1560s ] thds: 16 tps: 115.39 qps: 2307.90 (r/w/o: 1615.53/141.89/550.48) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1570s ] thds: 16 tps: 115.20 qps: 2304.01 (r/w/o: 1612.80/137.20/554.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1580s ] thds: 16 tps: 113.72 qps: 2274.46 (r/w/o: 1592.12/137.43/544.91) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1590s ] thds: 16 tps: 115.18 qps: 2303.56 (r/w/o: 1612.49/138.47/552.59) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1600s ] thds: 16 tps: 113.60 qps: 2271.95 (r/w/o: 1590.36/136.30/545.29) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 1610s ] thds: 16 tps: 116.71 qps: 2334.12 (r/w/o: 1633.88/140.61/559.63) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1620s ] thds: 16 tps: 120.10 qps: 2401.93 (r/w/o: 1681.35/147.60/572.98) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1630s ] thds: 16 tps: 120.00 qps: 2400.07 (r/w/o: 1680.05/145.80/574.22) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1640s ] thds: 16 tps: 118.30 qps: 2365.96 (r/w/o: 1656.17/146.80/562.99) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1650s ] thds: 16 tps: 124.70 qps: 2494.05 (r/w/o: 1745.83/151.70/596.51) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1660s ] thds: 16 tps: 120.20 qps: 2402.29 (r/w/o: 1681.49/147.80/573.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1670s ] thds: 16 tps: 121.50 qps: 2431.70 (r/w/o: 1702.30/148.60/580.80) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1680s ] thds: 16 tps: 120.00 qps: 2400.00 (r/w/o: 1680.00/147.70/572.30) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1690s ] thds: 16 tps: 120.10 qps: 2401.50 (r/w/o: 1681.30/147.10/573.10) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1700s ] thds: 16 tps: 118.40 qps: 2368.42 (r/w/o: 1657.65/145.60/565.18) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1710s ] thds: 16 tps: 119.90 qps: 2398.05 (r/w/o: 1678.63/142.40/577.01) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1720s ] thds: 16 tps: 118.40 qps: 2367.97 (r/w/o: 1657.58/145.80/564.59) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1730s ] thds: 16 tps: 116.80 qps: 2335.98 (r/w/o: 1635.19/142.00/558.80) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1740s ] thds: 16 tps: 118.40 qps: 2368.02 (r/w/o: 1657.62/143.70/566.71) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1750s ] thds: 16 tps: 115.30 qps: 2305.95 (r/w/o: 1614.16/140.70/551.09) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1760s ] thds: 16 tps: 118.31 qps: 2366.10 (r/w/o: 1656.27/144.11/565.72) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1770s ] thds: 16 tps: 115.30 qps: 2306.00 (r/w/o: 1614.20/139.60/552.20) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1780s ] thds: 16 tps: 116.80 qps: 2335.97 (r/w/o: 1635.18/145.90/554.89) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1790s ] thds: 16 tps: 118.50 qps: 2370.03 (r/w/o: 1659.02/145.70/565.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1800s ] thds: 16 tps: 120.00 qps: 2400.00 (r/w/o: 1680.00/146.60/573.40) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2834286
        write:                           236705
        other:                           977989
        total:                           4048980
    transactions:                        202449 (112.47 per sec.)
    queries:                             4048980 (2249.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      112.4651
    time elapsed:                        1800.1051s
    total number of events:              202449

Latency (ms):
         min:                                   75.03
         avg:                                  142.26
         max:                                  643.21
         95th percentile:                      193.38
         sum:                             28799943.46

Threads fairness:
    events (avg/stddev):           12653.0625/3.40
    execution time (avg/stddev):   1799.9965/0.01